app/views/users/show.html.erb

UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", "Sprout Status"], ["updated_at", "2020-06-16 00:06:19.914249"], ["id", 1]]
---
</div>
      <h5 class="my-3"><%= "#{@user.name} has earned: #{@user.update_status}"%><svg class="bi bi-check" width="30px" height="30px" viewBox="0 0 16 16" fill="currentColor" xmlns="http://www.w3.org/2000/svg">

SELECT "shares".* FROM "shares" WHERE "shares"."user_id" = ?  [["user_id", 21]]
---
  <!-- Related Projects Row -->
  <% if @user.shared_products.count > 0 %>