app/controllers/application_controller.rb

  def current_product
    Product.find_by(id: session[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]

def current_funding
  Funding.find_by(id: session[:funding_id])
---
SELECT "fundings".* FROM "fundings" WHERE "fundings"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]