app/controllers/fundings_controller.rb

  def create

    funding = Funding.create(fund_params)
---
INSERT INTO "fundings" ("user_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 26], ["amount", 50.0], ["created_at", "2020-06-17 16:37:51.389578"], ["updated_at", "2020-06-17 16:37:51.389578"]]