app/controllers/products_controller.rb

  def create
    product = Product.create(create_params)
---
INSERT INTO "products" ("name", "original_cost", "goal_amount", "end_date", "img_url", "summary", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)