app/controllers/product_fundings_controller.rb

INSERT INTO "product_fundings" ("product_id", "funding_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 37], ["funding_id", 59], ["created_at", "2020-06-17 17:21:48.898895"], ["updated_at", "2020-06-17 17:21:48.898895"]]
---
  def create
    product_funding = ProductFunding.create(pf_params)