app/controllers/shares_controller.rb

  def create
    # byebug
    Share.create(shares_params)
---
INSERT INTO "shares" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 27], ["product_id", 38], ["created_at", "2020-06-17 17:35:14.167295"], ["updated_at", "2020-06-17 17:35:14.167295"]]