app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "interests", "img_url", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create(user_params)