app/models/user.rb

SELECT "shares".* FROM "shares" WHERE "shares"."user_id" = ?  [["user_id", 21]]
---
  def shared_products
    self.shares.map do |s|

UPDATE "users" SET "seed_status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["seed_status", 1], ["updated_at", "2020-06-15 23:08:31.153827"], ["id", 1]]
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", "Sprout Status"], ["updated_at", "2020-06-16 00:06:19.914249"], ["id", 1]]
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", "Seed Status"], ["updated_at", "2020-06-16 00:30:17.922465"], ["id", 6]]
---
  def update_status
    if self.funded_products.count >= 10
      self.update(status: "Tree Status")
    elsif self.funded_products.count >= 5
      self.update(status: "Sprout Status")
    else self.funded_products.count < 5
      self.update(status: "Seed Status")