app/views/products/show.html.erb

SELECT "product_fundings".* FROM "product_fundings" WHERE "product_fundings"."product_id" = ?  [["product_id", 4]]
SELECT "fundings".* FROM "fundings" WHERE "fundings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  <!-- /.row -->
<% j=@product.product_fundings.map do |v|%>
<%  Funding.find(v.funding_id)%>

SELECT "product_fundings".* FROM "product_fundings" WHERE "product_fundings"."product_id" = ?  [["product_id", 5]]
SELECT "fundings".* FROM "fundings" WHERE "fundings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
<h3 class="back">This Product has Been Funded By</h3><br>
<% @product.product_fundings.each do |v|%>
<% u1 = Funding.find(v.funding_id)%>
<% u2 = User.find(u1.user_id) %>