app/views/products/show.html.erb

<% u1 = Funding.find(v.funding_id)%>
<% u2 = User.find(u1.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]